Stachu1/STM32_Watch/firmware/main.c
#include "stm32l0x1_peripherals.h"
#include "intrin.h"
#include "types.h"

#define EVER (;;)
#define SYSCLK 32000000
#define BAUD 115200
#define TS_CAL1 *((u16*) 0x1FF8007A)
#define TS_CAL2 *((u16*) 0x1FF8007E)
#define VREFINT_CAL *((u16*) 0x1FF80078)
#define IMU_ADDR 0x6A
#define BRIGHTNESS_STEPS 16 // Should be a power of 2 for performance
#define DEBOUNCE_TIME 150    // ms to debounce button presses
#define STATS_FRAME_TIME 50  // ms between each frame in the stats animation


typedef struct {
    u8 new_value;           // New value to set the hand to (1->12 0 for off)
    u8 value;               // Value of the hand (1-12 0 for off)
    u8 brightness;          // Brightness of the hand (0-(BRIGHTNESS_STEPS-1))
    u8 tick;                // Tick counter for breathing effect
    u8 tick_div;            // Tick divider for breathing speed control
    b8 fading_in;           // Whether the hand is currently fading in or out
} Hand;

typedef struct {
    volatile u32* port;     // Pointer to GPIO port
    u8 pin;                 // Pin number for the LED
} LED;

typedef struct {
    b8 pressed;             // Button was pressed flag (set after release if press was valid)
    u32 press_time;         // Time when the button was pressed (in ms)
} BTN;

volatile Hand hands[3] = {
    {1, 0, BRIGHTNESS_STEPS-1, 0, 0, true},     // Hour hand
    {2, 0, 0, 0, 8, true},                      // Minute hand
    {3, 0, 0, 0, 1, true}                       // Second hand
};

const volatile LED leds[] = {
    {(volatile u32*)GPIOB, 5},   // LED 1: PB5
    {(volatile u32*)GPIOB, 3},   // LED 2: PB3
    {(volatile u32*)GPIOA, 12},  // LED 3: PA12
    {(volatile u32*)GPIOB, 2},   // LED 4: PB2
    {(volatile u32*)GPIOA, 7},   // LED 5: PA7
    {(volatile u32*)GPIOA, 6},   // LED 6: PA6
    {(volatile u32*)GPIOA, 5},   // LED 7: PA5
    {(volatile u32*)GPIOA, 4},   // LED 8: PA4
    {(volatile u32*)GPIOA, 1},   // LED 9: PA1
    {(volatile u32*)GPIOB, 8},   // LED 10: PB8
    {(volatile u32*)GPIOB, 7},   // LED 11: PB7
    {(volatile u32*)GPIOB, 6}    // LED 12: PB6
};

const volatile u8 hex_table[16] = {'0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F'};
volatile BTN btn_up, btn_down;
volatile u8 pwm_step = BRIGHTNESS_STEPS * 3;
volatile u32 millis = 0;
volatile u8 sub_millis = 0;

enum Mode {
    MODE_TIME,
    MODE_VOLTAGE,
    MODE_TEMPERATURE,
    MODE_TIME_SETTING,
    MODE_PARTICLE_SIM
} current_mode;


void Spin(u32);
void Delay_us(u32);
void Delay_ms(u32);
void GPIO_Init(void);
void TIM21_Init(void);
void Hand_Set(u8, u8);
void UART_Init(void);
void UART_Deinit(void);
void Print_char(u8);
void Print_str(c*);
void Print_u32(u32);
void Print_i32(i32);
u8 Ambient_Sense(void);
void ADC_Init(void);
void ADC_Deinit(void);
u32 ADC_Get_VDDA(void);
i32 ADC_Get_Temp(void);
void I2C_Init(void);
void I2C_Write(u8, u8, u8*, u8);
void I2C_Read(u8, u8, u8*, u8);
void IMU_Init(void);
void IMU_Get_Accel(i16*, i16*, i16*);
i32 IMU_Get_Temp(void);
void RTC_Init(void);
void RTC_Set_Time(u8, u8, u8);
void RTC_Get_Time(u8*, u8*, u8*);
void RTC_Wakeup_Init(void);
void BTN_Init(void);
void Mode_Handler(void);
void Mode_Voltage_Handler(b8);
void Mode_Temperature_Handler(b8);
void Mode_Time_Setting_Handler(b8);
void Mode_Particle_Sim_Handler(b8);

// TODO: Particle simulation mode
// TODO: IMU Interrupts
// TODO: Sleep Mode
// TODO: Power and speed optimization


void main(void)
{
    GPIO_Init();
    TIM21_Init();
    UART_Init();
    ADC_Init();
    RTC_Init();
    I2C_Init();
    IMU_Init();
    BTN_Init();
    RTC_Wakeup_Init();

    RTC_Set_Time(1, 15, 30);

    for EVER
    {
        Mode_Handler();

        // leds[0].port[6] = (1 << leds[0].pin);
        // Delay_ms(1);
        // leds[0].port[6] = (1 << (leds[0].pin + 16)); // Set LED Low
    }
}

// === ISR ===

// TIM21 Interrupt Handler for SW PWM control of LEDs
void TIM21_IRQ_Handler(void)
{
    // Clear flag
    TIM21->SR &= ~TIM21_SR_UIF;

    // Update millis
    sub_millis++;
    if (sub_millis == 6) // ~6 kHz / 6 ~= 1 kHz for millis update
    {
        sub_millis = 0;
        millis++;
    }

    // Begin new PWM cycle
    pwm_step++;
    if (pwm_step >= BRIGHTNESS_STEPS * 3)
    {
        // Reset pwm_step
        pwm_step = 0;
        for (u8 i=0; i<3; i++)
        {
            // Update hand value to new_value (preventing ghosting when value changes mid hand time slot)
            hands[i].value = hands[i].new_value;

            // Skip if hand is static
            if (hands[i].tick_div == 0) continue;

            // Update tick and handle breathing effect
            hands[i].tick++;
            if (hands[i].tick == hands[i].tick_div)
            {
                // Reset tick and update brightness
                hands[i].tick = 0;
                if (hands[i].fading_in)
                {
                    // Increase brightness until max, then start fading out
                    if (hands[i].brightness < BRIGHTNESS_STEPS - 1) hands[i].brightness++;
                    else hands[i].fading_in = false;
                }
                else
                {
                    // Decrease brightness until min, then start fading in
                    if (hands[i].brightness > 0) hands[i].brightness--;
                    else hands[i].fading_in = true;
                }
            }
        }
    }

    // Get hand index for the current time slot
    u8 hand_idx = pwm_step / BRIGHTNESS_STEPS;
    u8 local_step = pwm_step % BRIGHTNESS_STEPS;

    // Turn on the LED for the current hand at the start of its brightness cycle
    if (local_step == 0 && hands[hand_idx].value > 0 && hands[hand_idx].brightness > 0)
    {
        u8 led_on = hands[hand_idx].value - 1;
        leds[led_on].port[6] = (1 << leds[led_on].pin);
    }

    // Turn off the LED for the current hand at the end of its brightness cycle
    if (local_step >= hands[hand_idx].brightness && hands[hand_idx].value > 0)
    {
        u8 led_off = hands[hand_idx].value - 1;
        leds[led_off].port[6] = (1 << (leds[led_off].pin + 16));
    }
}

// 1Hz RTC Interrupt Handler for hands update
void RTC_IRQ_Handler(void)
{
    // Clear EXTI Pending bit FIRST
    EXTI->PR = EXTI_PR_PIF20;

