Stachu1/STM32_Watch/firmware/main.c
    // Check if Wakeup Timer caused the interrupt
    if (RTC->ISR & RTC_ISR_WUTF) 
    {
        // Clear RTC Wakeup Flag
        RTC->WPR = 0xCA;
        RTC->WPR = 0x53;
        RTC->ISR &= ~RTC_ISR_WUTF;
        RTC->WPR = 0xFF; // Re-lock

        if (current_mode == MODE_TIME)
        {
            // Update Hand Logic
            u8 h, m, s;
            RTC_Get_Time(&h, &m, &s);

            // Set hand new_values based on current time
            hands[0].new_value = h;
            hands[1].new_value = (m / 5 == 0) ? 12 : (m / 5);
            hands[2].new_value = (s / 5 == 0) ? 12 : (s / 5); 
        }
    }
}

// EXTI Interrupt Handler for buttons
void EXTI0_1_IRQ_Handler(void)
{
    // Check PB0 btn_down
    if (EXTI->PR & (1 << 0))
    {
        if (!(GPIOB->IDR & (1 << 0)))
        {
            // LOW -> Falling Edge (PRESSED)
            btn_down.press_time = millis;
        }
        else
        {
            // HIGH -> Rising Edge (RELEASED)
            if (millis - btn_down.press_time >= DEBOUNCE_TIME)
            {
                btn_down.pressed = true;
            }
        }
        EXTI->PR = (1 << 0); // Clear the flag
    }

    // Check PB1 btn_up
    if (EXTI->PR & (1 << 1))
    {
        if (!(GPIOB->IDR & (1 << 1)))
        {
            // LOW -> Falling Edge (PRESSED)
            btn_up.press_time = millis;
        }
        else
        {
            // HIGH -> Rising Edge (RELEASED)
            if (millis - btn_up.press_time >= DEBOUNCE_TIME)
            {
                btn_up.pressed = true;
            }
        }
        EXTI->PR = (1 << 1); // Clear the flag
    }
}


// === Utility Functions ===

// Do nothing for 4 clock cyles
void Spin(u32 count)
{
    while (count--) __asm__ volatile ("nop");
}

// Delay microseconds based on Spin 
// (for delay above 100ms use Delay_ms)
void Delay_us(u32 us)
{
    u32 spins = (us * (SYSCLK/1000)) / 4000;
    Spin(spins);
}

// Delay milliseconds based on Delay_us
void Delay_ms(u32 ms)
{
    (void)ms;
    u32 hundereds = ms / 100;
    u32 rest = ms - hundereds * 100;
    for (u32 i=0; i<hundereds; i++)
    {
        Delay_us(100000);
    }
    Delay_us(rest * 1000);
}

// Init GPIOs for the LEDs
void GPIO_Init(void)
{
    // Enable GPIOA and GPIOB clocks
    RCC->IOPENR |= RCC_IOPENR_IOPAEN | RCC_IOPENR_IOPBEN;

    // Set PA1, PA4, PA5, PA6, PA7, PA12 to output (MODE = 01)
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE1, 0x1);   // PA1 as output
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE4, 0x1);   // PA4 as output
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE5, 0x1);   // PA5 as output
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE6, 0x1);   // PA6 as output
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE7, 0x1);   // PA7 as output
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE12, 0x1);  // PA12 as output

    // Set PB2, PB3, PB5, PB6, PB7, PB8 to output (MODE = 01)
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE2, 0x1);   // PB2 as output
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE3, 0x1);   // PB3 as output
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE5, 0x1);   // PB5 as output
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE6, 0x1);   // PB6 as output
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE7, 0x1);   // PB7 as output
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE8, 0x1);   // PB8 as output
}

// Init TIM21 and enable its interrupt
// for SW PWM control of the LEDs and ms couunting
void TIM21_Init(void)
{
    // Enable TIM21 peripheral clock
    RCC->APB2ENR |= RCC_APB2ENR_TIM21EN;

    // Run at full 32MHz
    TIM21->PSC = 0;
    TIM21->ARR = 5333; // 32MHz / 5333 ~ 6kHz for LED PWM updates
    
    // Enable update interrupt and start counter
    TIM21->DIER |= TIM21_DIER_UIE;
    TIM21->CR1 |= TIM21_CR1_CEN;

    // Enable TIM21 interrupt in NVIC
    NVIC->ISER |= (1 << 20);
}

// Set the value of a hand (1-12, 0 for off)
void Hand_Set(u8 hand_index, u8 value)
{
    if (hand_index > 2) return;
    hands[hand_index].new_value = value;
}

// Init UART at #BUAD
void UART_Init(void)
{
    // Enable clock
    RCC->APB1ENR |= RCC_APB1ENR_USART2EN;
    
    // Set alterative pin func
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE2, 0x2);   // PA2
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE3, 0x2);   // PA3

    // Enable alterative func
    BF_SET(GPIOA->AFRL, GPIOA_AFRL_AFSEL2, 0x4);    // PA2
    BF_SET(GPIOA->AFRL, GPIOA_AFRL_AFSEL3, 0x4);    // PA3

    // Disable USART
    USART2->CR1 &= ~USART2_CR1_UE;

    // Set word len, Parity ctrl, 1 Stop bit, Enable TX
    USART2->CR1 &= ~(USART2_CR1_M0 | USART2_CR1_M1);
    USART2->CR1 &= ~USART2_CR1_PCE;
    BF_SET(USART2->CR2,USART2_CR2_STOP, 0x0);
    USART2->CR1 |= USART2_CR1_TE;

    // Set USART div (sysclk / baud_rate)
    USART2->BRR = (SYSCLK / BAUD) & 0xFFFF;         

    // Enable USART
    USART2->CR1 |= USART2_CR1_UE;
}

// Deinit UART
void UART_Deinit(void)
{
    // Disable UART
    USART2->CR1 &= ~USART2_CR1_UE;

    // Reset UART
    RCC->APB1RSTR |= RCC_APB1RSTR_USART2RST;
    RCC->APB1RSTR &= ~RCC_APB1RSTR_USART2RST;

    // Set PA2 and PA3 back to Analog Mode (0x3)
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE2, 0x3);
    BF_SET(GPIOA->MODER, GPIOA_MODER_MODE3, 0x3);

    // Clear AF selection
    BF_SET(GPIOA->AFRL, GPIOA_AFRL_AFSEL2, 0x0);
    BF_SET(GPIOA->AFRL, GPIOA_AFRL_AFSEL3, 0x0);

    // Disable clock
    RCC->APB1ENR &= ~RCC_APB1ENR_USART2EN;
}

// Sends char over UART
void Print_char(u8 c)
{
    while (!(USART2->ISR & USART2_ISR_TXE));
    BF_SET(USART2->TDR, USART2_TDR_TDR, c);
}

// Sends string over UART
void Print_str(c *str)
{
    while (*str)
    {
        Print_char(*(str++));
    }
}

// Sends u32 over UART
void Print_u32(u32 num)
{
    if (num == 0)
    {
        Print_char('0');
        return;
    }

    u8 digits[10];  
    u32 num_len = 0;

    while (num)
    {
        digits[num_len++] = '0' + (num % 10);
        num /= 10;
    }

    for (u32 i=num_len; i>0; i--)
    {
        Print_char(digits[i - 1]);
    }
}

// Sends i32 over UART
void Print_i32(i32 num)
{
    if (num == 0)
    {
        Print_char('0');
        return;
    }

    b32 is_neg = (num < 0) ? true : false;
    if (is_neg) num = -num;

