Stachu1/STM32_Watch/firmware/main.c
    // Set 12h format
    RTC->CR |= RTC_CR_FMT;

    // Set time in BCD format
    u32 temp_tr = 0;
    temp_tr |= ((hours / 10) << RTC_TR_HT_LSB) | ((hours % 10) << RTC_TR_HU_LSB);
    temp_tr |= ((minutes / 10) << RTC_TR_MNT_LSB) | ((minutes % 10) << RTC_TR_MNU_LSB);
    temp_tr |= ((seconds / 10) << RTC_TR_ST_LSB) | (seconds % 10);
    RTC->TR = temp_tr;

    // Exit initialization mode
    RTC->ISR &= ~RTC_ISR_INIT;

    // Wait for synchronization
    RTC->ISR &= ~RTC_ISR_RSF; 
    while (!(RTC->ISR & RTC_ISR_RSF)) Spin(10);

    // Enable write protection
    RTC->WPR = 0xFF;
}

// Get RTC time
void RTC_Get_Time(u8 *hours, u8 *minutes, u8 *seconds)
{
    // Wait for RTC to be ready
    RTC->ISR &= ~RTC_ISR_RSF;
    while (!(RTC->ISR & RTC_ISR_RSF)) Spin(10);

    // Read time
    u32 tr = RTC->TR;
    *hours = ((tr & RTC_TR_HT_MASK) >> RTC_TR_HT_LSB) * 10 + ((tr & RTC_TR_HU_MASK) >> RTC_TR_HU_LSB);
    *minutes = ((tr & RTC_TR_MNT_MASK) >> RTC_TR_MNT_LSB) * 10 + ((tr & RTC_TR_MNU_MASK) >> RTC_TR_MNU_LSB);
    *seconds = ((tr & RTC_TR_ST_MASK) >> RTC_TR_ST_LSB) * 10 + ((tr & RTC_TR_SU_MASK) >> RTC_TR_SU_LSB);
}

// Enable RTC 1Hz interrupt for hand updates
void RTC_Wakeup_Init(void)
{
    // Wait for RTC to be ready
    RTC->ISR &= ~RTC_ISR_RSF;
    while (!(RTC->ISR & RTC_ISR_RSF)) Spin(10);

    // Disable Write Protection
    RTC->WPR = 0xCA;
    RTC->WPR = 0x53;

    // Disable Wakeup Timer to configure it
    RTC->CR &= ~RTC_CR_WUTE;

    // Wait for access allowed
    while (!(RTC->ISR & RTC_ISR_WUTWF)) Spin(10);

    // Configure Clock Source for 1Hz
    // WUCKSEL = 0b100 selects the 1Hz clock (RTCCLK div by prescalers)
    RTC->CR &= ~(RTC_CR_WUCKSEL_MASK << RTC_CR_WUCKSEL_LSB);
    RTC->CR |= (0x4 << RTC_CR_WUCKSEL_LSB);

    // Clear Wakeup Timer flag and EXTI pending bit
    RTC->ISR &= ~RTC_ISR_WUTF;
    EXTI->PR = EXTI_PR_PIF20;

    // For 1Hz clock, WUTR = 0 means 1 second interval (Interval = WUTR + 1)
    RTC->WUTR = 0;

    // Enable Interrupt and Timer
    RTC->CR |= RTC_CR_WUTIE | RTC_CR_WUTE;

    // Enable Write Protection
    RTC->WPR = 0xFF;

    // RTC Wakeup is connected to EXTI Line 20
    EXTI->IMR |= (1 << 20);    // Interrupt Mask: Enable line 20
    EXTI->RTSR |= (1 << 20);   // Rising Trigger: Enable

    // Enable RTC global interrupt in NVIC
    NVIC->ISER |= (1 << 2);
}

// Buttons GPIO and interrupt init
void BTN_Init(void)
{
    // Enable SYSCFG Clock
    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;

    // Configure PB0 and PB1 as Input
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE0, 0x0);   // PB0 as input
    BF_SET(GPIOB->MODER, GPIOB_MODER_MODE1, 0x0);   // PB1 as input

    // Enable Internal Pull-Ups
    BF_SET(GPIOB->PUPDR, GPIOB_PUPDR_PUPD0, 0x1);
    BF_SET(GPIOB->PUPDR, GPIOB_PUPDR_PUPD1, 0x1);

    // Map PB0 and PB1 to EXTI Line 0 and 1
    SYSCFG_COMP->EXTICR1 &= ~(SYSCFG_COMP_EXTICR1_EXTI0_MASK | SYSCFG_COMP_EXTICR1_EXTI1_MASK);
    SYSCFG_COMP->EXTICR1 |= ((1 << SYSCFG_COMP_EXTICR1_EXTI0_LSB) | (1 << SYSCFG_COMP_EXTICR1_EXTI1_LSB));

    // Enable Rising and Falling Edge triggers
    EXTI->FTSR |= (EXTI_FTSR_FT0 | EXTI_FTSR_FT1); // Press
    EXTI->RTSR |= (EXTI_RTSR_RT0 | EXTI_RTSR_RT1); // Release
    EXTI->IMR  |= (EXTI_IMR_IM0 | EXTI_IMR_IM1);   // Unmask

    // Enable EXTI0_1 Interrupt (IRQ 5)
    NVIC->ISER |= (1 << 5);
}

// Handle mode changes and mode-specific logic
void Mode_Handler(void)
{
    switch (current_mode)
    {
        case MODE_TIME:
            if (btn_up.pressed)
            {
                btn_up.pressed = false;
                Print_str("Changed brightness\n");
            }
            if (btn_down.pressed)
            {
                btn_down.pressed = false;
                Print_str("Mode voltage\n");
                current_mode = MODE_VOLTAGE;
                Mode_Voltage_Handler(true);
            }
            break;
        case MODE_VOLTAGE:
            if (btn_up.pressed)
            {
                btn_up.pressed = false;
                Print_str("Mode temperature\n");
                current_mode = MODE_TEMPERATURE;
                Mode_Temperature_Handler(true);
            }
            if (btn_down.pressed)
            {
                btn_down.pressed = false;
                Print_str("Mode time setting entry\n");
                current_mode = MODE_TIME_SETTING;
                Mode_Time_Setting_Handler(true);
            }
            Mode_Voltage_Handler(false);
            break;
        case MODE_TEMPERATURE:
            if (btn_up.pressed)
            {
                btn_up.pressed = false;
                Print_str("Mode voltage\n");
                current_mode = MODE_VOLTAGE;
                Mode_Voltage_Handler(true);
            }
            if (btn_down.pressed)
            {
                btn_down.pressed = false;
                Print_str("Mode time setting entry\n");
                current_mode = MODE_TIME_SETTING;
                Mode_Time_Setting_Handler(true);
            }
            Mode_Temperature_Handler(false);
            break;
        case MODE_TIME_SETTING:
            Mode_Time_Setting_Handler(false);
            break;
        case MODE_PARTICLE_SIM:
            if (btn_up.pressed)
            {
                btn_up.pressed = false;
                Print_str("Changing brightness (some day)\n");
            }
            if (btn_down.pressed)
            {
                btn_down.pressed = false;
                Print_str("Mode time\n");
                current_mode = MODE_TIME;
            }
            break;
    }
}

// Voltage mode: map battery voltage to hand position
void Mode_Voltage_Handler(b8 reset)
{
    static u32 last_update = 0;
    static u8 hand_idx = 0;

    if (last_update == 0 || reset)
    {
        u32 vdda_mV = ADC_Get_VDDA();
        Print_str("Battery Voltage: ");
        Print_u32(vdda_mV);
        Print_str(" mV\n");

        // Map 2.0V-3.2V to 0-12 hand index (100mV per step)
        hand_idx = ((vdda_mV - 2000) / 100);
        if (hand_idx > 12) hand_idx = 12;
        hands[0].new_value = 0;
        hands[1].new_value = 0;
        hands[2].new_value = 0;
    }

