Stachu1/STM32_Watch/firmware/main.c
    // Update hand values gradually for smooth animation
    if (millis - last_update >= STATS_FRAME_TIME)
    {
        last_update = millis;
        if (hands[0].new_value < hand_idx)
        {
            hands[0].new_value++;
        }
    }
}

// Temperature mode: map IMU temperature to hand position
void Mode_Temperature_Handler(b8 reset)
{
    static u32 last_update = 0;
    static u8 hand_h_idx = 0;
    static u8 hand_m_idx = 0;

    if (last_update == 0 || reset)
    {
        u32 temp_mC = IMU_Get_Temp();
        Print_str("IMU Temperature: ");
        Print_u32(temp_mC);
        Print_str(" mC\n");

        // Map 0°C-60°C to 0-12 hand_h index (5°C per step)
        // and 0.5°C per step for hand_m index
        hand_h_idx = temp_mC / 5000;
        hand_m_idx = (temp_mC - hand_h_idx * 5000) / 500;
        if (hand_h_idx > 12) hand_h_idx = 12;
        if (hand_m_idx > 12) hand_m_idx = 12;

        hands[0].new_value = 0;
        hands[1].new_value = 0;
        hands[2].new_value = 0;
    }

    // Update hand values gradually for smooth animation
    if (millis - last_update >= STATS_FRAME_TIME)
    {
        last_update = millis;
        if (hands[0].new_value < hand_h_idx)
        {
            hands[0].new_value++;
        }
        if (hands[1].new_value < hand_m_idx)
        {
            hands[1].new_value++;
        }
    }
}


void Mode_Time_Setting_Handler(b8 reset)
{
    static u32 last_update = 0;
    static enum {
        ENTRY,
        SET_HOURS,
        SET_MINUTES,
    } stage;
    static u8 h = 0, m = 0;

    if (reset)
    {
        // On entry, read RTC and round min down to nearest 5
        stage = ENTRY;
        hands[0].new_value = 0;
        hands[1].new_value = 0;
        hands[2].new_value = 0;
    }

    switch (stage)
    {
    case ENTRY:
        if (millis - last_update >= STATS_FRAME_TIME / 2)
        {
            last_update = millis;
            hands[0].new_value++;
            if (hands[0].new_value > 12) hands[0].new_value = 1;
        }
        if (btn_up.pressed)
        {
            btn_up.pressed = false;
            stage = SET_HOURS;
            Print_str("Setting Hours\n");
            h = 12;
            hands[0].new_value = h;
        }
        if (btn_down.pressed)
        {
            btn_down.pressed = false;
            current_mode = MODE_PARTICLE_SIM;
        }
        break;
    case SET_HOURS:
        if (btn_up.pressed)
        {
            btn_up.pressed = false;
            stage = SET_MINUTES;
            Print_str("Setting Minutes\n");
            hands[0].new_value = 0;
            m = 60;
            hands[1].new_value = (m / 5 == 0) ? 12 : (m / 5);
        }
        if (btn_down.pressed)
        {
            btn_down.pressed = false;
            h = (h == 12) ? 1 : h + 1;
            hands[0].new_value = h;
        }
        break;
    case SET_MINUTES:
        if (btn_up.pressed)
        {
            btn_up.pressed = false;
            current_mode = MODE_TIME;
            RTC_Set_Time(h, m, 0);

            // Set hand new_values based on current time
            hands[0].new_value = h;
            hands[1].new_value = (m / 5 == 0) ? 12 : (m / 5);
            hands[2].new_value = 12; 
            Print_str("Time Set\n");
        }
        if (btn_down.pressed)
        {
            btn_down.pressed = false;
            m = (m > 55) ? 5 : m + 5;
            hands[1].new_value = (m / 5 == 0) ? 12 : (m / 5);
        }
        break;
    }
}


void Mode_Particle_Sim_Handler(b8);